#+STARTUP: hideblocks overview indent :
#+OPTIONS: toc:nil num:nil ^:nil:
#+PROPERTY: header-args:sqlite :results output
* Explore the =sqlite3= shell/console/terminal (DQL)

- The learning of a programming language begins with being to get
  answers first on the syntax, and then on the logic of the program

- Get all help on the console from the OS shell: open an shell inside
  Emacs with ~M-x eshell~ and run this command:
  #+begin_src bash
    sqlite3 --help
  #+end_src

- You can now open SQLite on a new (or existing) database while
  directly specifying that it displays output in tables with columns
  and header.

- Try that with the ~foods.sqlite~ database that you created last time.
  #+begin_example bash
    sqlite3 -header -column foods.sqlite
  #+end_example

- On the console, check that the initialization worked with ~.show~

- If you don't have a database, you still run the command and check
  the settings - the database will now be created.

- Get the help on the console for in-program control commands:
  #+begin_src sqlite :db test.db :header :column :results output
    .help
  #+end_src

  #+RESULTS:
  #+begin_example
  .archive ...             Manage SQL archives
  .auth ON|OFF             Show authorizer callbacks
  .backup ?DB? FILE        Backup DB (default "main") to FILE
  .bail on|off             Stop after hitting an error.  Default OFF
  .binary on|off           Turn binary output on or off.  Default OFF
  .cd DIRECTORY            Change the working directory to DIRECTORY
  .changes on|off          Show number of rows changed by SQL
  .check GLOB              Fail if output since .testcase does not match
  .clone NEWDB             Clone data into NEWDB from the existing database
  .connection [close] [#]  Open or close an auxiliary database connection
  .databases               List names and files of attached databases
  .dbconfig ?op? ?val?     List or change sqlite3_db_config() options
  .dbinfo ?DB?             Show status information about the database
  .dump ?OBJECTS?          Render database content as SQL
  .echo on|off             Turn command echo on or off
  .eqp on|off|full|...     Enable or disable automatic EXPLAIN QUERY PLAN
  .excel                   Display the output of next command in spreadsheet
  .exit ?CODE?             Exit this program with return-code CODE
  .expert                  EXPERIMENTAL. Suggest indexes for queries
  .explain ?on|off|auto?   Change the EXPLAIN formatting mode.  Default: auto
  .filectrl CMD ...        Run various sqlite3_file_control() operations
  .fullschema ?--indent?   Show schema and the content of sqlite_stat tables
  .headers on|off          Turn display of headers on or off
  .help ?-all? ?PATTERN?   Show help text for PATTERN
  .import FILE TABLE       Import data from FILE into TABLE
  .imposter INDEX TABLE    Create imposter table TABLE on index INDEX
  .indexes ?TABLE?         Show names of indexes
  .limit ?LIMIT? ?VAL?     Display or change the value of an SQLITE_LIMIT
  .lint OPTIONS            Report potential schema issues.
  .load FILE ?ENTRY?       Load an extension library
  .log FILE|off            Turn logging on or off.  FILE can be stderr/stdout
  .mode MODE ?TABLE?       Set output mode
  .nonce STRING            Disable safe mode for one command if the nonce matches
  .nullvalue STRING        Use STRING in place of NULL values
  .once ?OPTIONS? ?FILE?   Output for the next SQL command only to FILE
  .open ?OPTIONS? ?FILE?   Close existing database and reopen FILE
  .output ?FILE?           Send output to FILE or stdout if FILE is omitted
  .parameter CMD ...       Manage SQL parameter bindings
  .print STRING...         Print literal STRING
  .progress N              Invoke progress handler after every N opcodes
  .prompt MAIN CONTINUE    Replace the standard prompts
  .quit                    Exit this program
  .read FILE               Read input from FILE
  .recover                 Recover as much data as possible from corrupt db.
  .restore ?DB? FILE       Restore content of DB (default "main") from FILE
  .save FILE               Write in-memory database into FILE
  .scanstats on|off        Turn sqlite3_stmt_scanstatus() metrics on or off
  .schema ?PATTERN?        Show the CREATE statements matching PATTERN
  .selftest ?OPTIONS?      Run tests defined in the SELFTEST table
  .separator COL ?ROW?     Change the column and row separators
  .session ?NAME? CMD ...  Create or control sessions
  .sha3sum ...             Compute a SHA3 hash of database content
  .shell CMD ARGS...       Run CMD ARGS... in a system shell
  .show                    Show the current values for various settings
  .stats ?ARG?             Show stats or turn stats on or off
  .system CMD ARGS...      Run CMD ARGS... in a system shell
  .tables ?TABLE?          List names of tables matching LIKE pattern TABLE
  .testcase NAME           Begin redirecting output to 'testcase-out.txt'
  .testctrl CMD ...        Run various sqlite3_test_control() operations
  .timeout MS              Try opening locked tables for MS milliseconds
  .timer on|off            Turn SQL timer on or off
  .trace ?OPTIONS?         Output each SQL statement as it is run
  .vfsinfo ?AUX?           Information about the top-level VFS
  .vfslist                 List all available VFSes
  .vfsname ?AUX?           Print the name of the VFS stack
  .width NUM1 NUM2 ...     Set minimum column widths for columnar output
  #+end_example

- How can I find out where I am? (Substitute ~pwd~ for ~DIR~ when you're
  on Windows)
  #+begin_src sqlite :db test.db :header :column :results output
    .shell pwd
  #+end_src

  #+RESULTS:
  : /home/marcus/GitHub/db24/org

* Creating a database (DDL)

- Create a new file ~sqlite.org~ to code along. Create a headline
  "Creating a database DDL".

- Use ~<sqlite~ if you defined it in ~org-structure-template-alist~ to
  create a new codeblock. Check which database sqlite3 writes to, and
  if it has any tables in it:
  #+begin_src sqlite :db test.db
    .database
    .tables
  #+end_src

  #+RESULTS:
  : main: /home/marcus/GitHub/db24/org/test.db r/w

* Querying a table (DQL)

- We can look at the entire table (show ~header~ and use ~column~ mode):
  #+begin_src sqlite :db test.db :header :column
    SELECT * FROM test;
  #+end_src

  #+RESULTS:
  : id  value
  : --  ------------------
  : 1   Ms. Jane Robinson
  : 2   Mme. Carl Robinson
  : 3   Mr. Edward Jones

- Notice that despite the code block header you can still change the
  options inside the code block:
  #+begin_src sqlite :db test.db :header :column
    .header off
    SELECT * FROM test LIMIT 2;
  #+end_src

  #+RESULTS:
  : 1   Ms. Jane Robinson
  : 2   Mme. Carl Robinson

- You notice that constraining ~id~ as ~PRIMARY KEY~ included ~AUTO
  INCREMENT~ - the value is automatically increased by one for each new
  row.

- If you used ~AUTO INCREMENT~, you can get the value of the last
  non-empty row with an SQL function:
  #+begin_src sqlite :db test.db :header :column
    DROP TABLE IF EXISTS foo;
    -- create a temporary table
    CREATE TEMP TABLE foo (id INT AUTO INCREMENT, pray TEXT);
    -- insert two records
    INSERT INTO foo (pray) VALUES ("In Nomine Patri");
    INSERT INTO foo (pray) VALUES ("Et Spiritui Sancto");
    SELECT LAST_INSERT_ROWID();
  #+end_src

  #+RESULTS:
  : LAST_INSERT_ROWID()
  : -------------------
  : 2

* Changing table content (DML)

- The second row contains a mistake: it should be 'Mr.' instead of
  'Mme.' (which is French for 'Mrs.'):
  #+begin_src sqlite :db test.db :results output :header :column
    SELECT * FROM test;
  #+end_src

  #+RESULTS:
  : id  value
  : --  ------------------
  : 1   Ms. Jane Robinson
  : 2   Mme. Carl Robinson
  : 3   Mr. Edward Jones

- To change this, we can use =UPDATE=, which uses a /row filter/:
  #+begin_src sqlite :db test.db :results output :header :column
    UPDATE test
    SET value = 'Mr. Carl Robinson'
    WHERE id = 2;
    SELECT  * FROM test;
  #+end_src

  #+RESULTS:
  : id  value
  : --  -----------------
  : 1   Ms. Jane Robinson
  : 2   Mr. Carl Robinson
  : 3   Mr. Edward Jones

- What do you think would happen if you'd forget the =WHERE= clause?
  #+begin_src sqlite :db test.db :results output :header :column
    CREATE TEMP TABLE test1 AS
    SELECT * FROM test; -- makes a copy
    SELECT * FROM test1;
    UPDATE test1
    SET value = 'Mr. Karl Robinson'; -- missing the WHERE filter
    SELECT * FROM test1;
  #+end_src

  #+RESULTS:
  #+begin_example
  id  value
  --  -----------------
  1   Ms. Jane Robinson
  2   Mr. Carl Robinson
  3   Mr. Edward Jones
  id  value
  --  -----------------
  1   Mr. Karl Robinson
  2   Mr. Karl Robinson
  3   Mr. Karl Robinson
  #+end_example

* Change table structure (DDL)

- SQLite is more limited to making schema changes than other SQL
  flavors,because of its architecture:
  1) You can rename tables
  2) You can add columns to an existing table
  3) You can drop existing columns from an existing table
  4) You can NOT delete, change or rename columns

- The DDL command is =ALTER TABLE=:
  #+begin_example sqlite
    ALTER TABLE tbl_name {REN|AME TO new_name | ADD COLUMN colDef}
  #+end_example

- We rename the table ~test~ to ~test_new~:
  #+begin_src sqlite :db test.db :results output :header :column
    .tables
    ALTER TABLE test RENAME TO test_new;
    .tables
    ALTER TABLE test_new RENAME TO test;
    .tables
  #+end_src

  #+RESULTS:
  : test
  : test_new
  : test

- We can also add a column:
  #+begin_src sqlite :db test.db :results output :header :column
    ALTER TABLE test ADD COLUMN sex TEXT;
    SELECT * FROM test;
  #+end_src

  #+RESULTS:
  : id  value              sex
  : --  -----------------  ---
  : 1   Ms. Jane Robinson
  : 2   Mr. Carl Robinson
  : 3   Mr. Edward Jones

- Delete the new column again with the =DROP COLUMN= clause, and then
  review the database structure:
  #+begin_src sqlite :db test.db :results output :header :column
    ALTER TABLE test DROP COLUMN sex;
    .schema
  #+end_src

  #+RESULTS:
  : CREATE TABLE IF NOT EXISTS "test" (id INTEGER PRIMARY KEY, value TEXT);

* Viewing the table index (DDL)

- An index is a keyword index. Creating an index speeds up DQL
  commands and slows down DML commands.

- The following command creates an index for the only non-trivial
  column of the table ~test~:
  #+begin_src sqlite :db test.db :results silent :header :column
    CREATE INDEX test_idx ON test (value);
  #+end_src

- The console command =.indices= lists the defined indices, and the
  =.schema= command shows that the db architecture has changed:
  #+begin_src sqlite :db test.db :results output :header :column
    .indices test
    .schema
  #+end_src

  #+RESULTS:
  : test_idx
  : CREATE TABLE IF NOT EXISTS "test" (id INTEGER PRIMARY KEY, value TEXT);
  : CREATE INDEX test_idx ON test (value);

- We will prefer graphical (ERD) descriptions of the database
  architecture as soon as we have more than a handful of tables.

* Viewing table views (DQL)

- Let's rekindle our knowledge of stored queries or views: for
  example a view that contains only the ~value~ column. And
  let's check the db size before the transaction:
  #+begin_src sqlite :db test.db :results output :header :column
    .shell ls -l test.db
  #+end_src

  #+RESULTS:
  : -rw-r--r-- 1 marcus marcus 12288 Feb 20 15:36 test.db

- Create the view:
  #+begin_src sqlite :db test.db :results output :header :column
    CREATE VIEW value_view AS SELECT value FROM test;
    .tables
    .schema
  #+end_src

  #+RESULTS:
  : test        value_view
  : CREATE TABLE IF NOT EXISTS "test" (id INTEGER PRIMARY KEY, value TEXT);
  : CREATE INDEX test_idx ON test (value);
  : CREATE VIEW value_view AS SELECT value FROM test
  : /* value_view(value) */;

- As you can see, ~value_view~ is listed by =.tables=. If you
  check the size, you'll see that it has not visibly changed:
  #+begin_src sqlite :db test.db :results output :header :column
    .shell ls -l test.db
  #+end_src

  #+RESULTS:
  : -rw-r--r-- 1 marcus marcus 12288 Feb 20 15:39 test.db

- You can delete views like tables with =DROP VIEW=.

